[{"title":"Kickstart with Hexo & Github","date":"2016-12-31T06:56:16.000Z","path":"2016/12/31/First-Post/","text":"I come across Hexo when I want to record my journal of learning code. I’m going to show you how I start this blog with hexo in Windows. What is Hexo then?Hexo is a powerful blog framework. Upon installing, we can create posts immediately without writing HTML, JS, etc. However, if you need custom themes, you will still have to write your own code~ Hexo’s posts are written in Markdown and it is very easy to write. Here is one of the markdown cheatsheets: markdown here Before we startTo install Hexo, we will need to install the followings first: Node.js Git Once all of the above are installed, open cmd and navigate to your designated directory, mine is D:\\node-js-workspace\\hexo\\learningBlog Then, install hexo with npm: 1npm install -g hexo-cli After installation, you can check your hexo by: 1hexo --version For deployment, we also have to install hexo-deployer-git: 1npm install hexo-deployer-git --save Initialize the blogNow we can initialize a Hexo project. Again, go to your directory and run these: 123cd D:\\node-js-workspace\\hexo\\learningBloghexo init myBlognpm install You can modify _config.yml to change settings such as site information, url, etc. Run the blogAgain and again, go to the hexo directory and run: 1hexo server Now, you can check your blog in http://localhost:4000/. The blog initially have a Hello Word page like this: Create new postIt is super easy to create a new post. Just run: 1hexo new &quot;First Post&quot; You will find all the posts created in ..\\source_posts folder. All post files are .md files. New post uses ..\\scaffolds\\post.md as template. By default, your file looks like this: By changing ..\\scaffolds\\post.md, you can change the default content of every new post. Your blog is almost complete :D Now let’s deploy it to Github. DeploymentLet’s go to Github and create a new repository.Remember to Add .gitignore: Node during creation. After creation, check the Merge button setting. In Github Pages section, choose master branch and save it. We will now have to update the deployment information in _config.yaml Firstly, click Clone or download to obtain the URL: Secondly,go to your _config.yaml and update: Since we have wrote all the content in markdown, we will have to generate the HTML files for the site. We have to run: 1hexo generate Now comes to our last step. Run this to deploy it: 1hexo deploy P.S. We can also combine the above two steps into one by: 1hexo generate --deploy You will see Deploy done message after finished: You can now check your blog in your repo :D","tags":[]}]